# Core
brew "git"
brew "stow"

# Shell
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "pure"

# Search & navigation
brew "fzf"
brew "fd"
brew "ripgrep"
brew "ast-grep"
brew "direnv"

# Modern CLI
brew "bat"
brew "eza"
brew "jq"
brew "git-delta"

# Editors & multiplexer
brew "neovim"
brew "tmux"
brew "lazygit"

# Development
brew "gh"
brew "libpq"

# Utilities
brew "pv"
brew "wget"

# GUI
cask "wezterm"
